# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]      # 8

# Changes to head definition from base yaml:
# - Upsample only width (height=1)
# Replaced detection w/ forecast head + params

head:
  # FPN from P5 (8) -> P4 (6) -> P3 (4)
  # Input H=1, W=512.
  # P5 (Stride 32): H=1, W=16.
  # P4 (Stride 16): H=1, W=32.
  # P3 (Stride 8):  H=1, W=64.
  
head:
  # FPN from P5 (8) -> P4 (6) -> P3 (4)
  # Input H=1, W=512.
  # Backbone ends at 8.
  
  - [-1, 1, UpW, [2, "nearest"]]                 # 9: P5 -> P4 scale (W*2)
  - [[-1, 6], 1, Concat, [1]]                     # 10: cat P4
  - [-1, 2, C3k2, [512, False]]                   # 11: P4 fused

  - [-1, 1, UpW, [2, "nearest"]]                 # 12: P4 -> P3 scale (W*2)
  - [[-1, 4], 1, Concat, [1]]                     # 13: cat P3
  - [-1, 2, C3k2, [256, False]]                   # 14: P3 fused

  # Forecast Head using [P3, P4, P5]
  # P3=14, P4=11, P5=8
  # Pool to W=16 (Smallest feature map width)
  - [[14, 11, 8], 1, Forecast, [36, null, 256, 0.2, "concat", 16]]
